public class lesson3 {
    public static void main(String[] args) {
                                // Працюємо з git
//        git init: Ініціалізує новий репозиторій Git у поточному каталозі.
//        git clone <url>: Клонує існуючий репозиторій Git в новий каталог.
//        git add <file>: Додає файли до індексу (staging area) для подальшого коміту.
//        git commit -m "Повідомлення коміту": Створює коміт з доданими до індексу файлами та пов'язаною з ними повідомленням.
//        git status: Показує стан робочого каталогу та індексу.
//        git pull: Витягує зміни з віддаленого репозиторію і об'єднує їх з поточною гілкою.
//        git push: Надсилає локальні коміти в віддалений репозиторій.
//        git branch: Показує список локальних гілок, а також допомагає створювати, видаляти і перемикатися між ними.
//        git checkout <branch>: Перемикається на вказану гілку.
//        git merge <branch>: Об'єднує вказану гілку з поточною.
//        git fetch: Витягує зміни з віддаленого репозиторію, але не об'єднує їх з поточною гілкою.
//        git remote: Показує список віддалених репозиторіїв та дозволяє керувати ними.







    }
}
